app/controllers/api/recipes_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "recipes".* FROM "recipes"
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
---
    def index
      @recipes = Recipe.includes(:category, :ingredients, :tags).all